//  Типы данных - Данныйлардын типтери маалымат турлору

// 1 - Undefined (Неопределённый тип) - Белгисиз тип
// 2 - Boolean (Булев, Логический тип) (true,false) - Чындык жана жалган
// 3 - Number (Число) - сандар 123245
// 4 - String (Строка, "" - '' - ``) - Сап жонокой жазуулар тырмакча
// 5 - BigInt 1234567890987654323456789 - Чон сандар мн иштейт
// 6 - Symbol (в ECMAScript 6) - символ - $, &, *, +, -, ?, =, /, !, % ж.б
// 7 - Null (Null тип ) - Жок нерсе, не существует
// 8 - Object (Объект)

// lesson 1 - number + переменные

// var - Эски перемена
// let - Мааниси озгорот
// const - Мааниси озгорбойт


// Переменныйлар - Маалымат сактоо учун керек озгормолор

// +, -, *, /, %

// console.log() - Резултатын чыгарып берет





// 1. Вам дана переменная num, присвойте ей значение. Выведите значение
// этой переменной в консоль.
// let num = 10
// console.log(num)

// 2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.
// let a = 10
// let b = 2
// let c =5
// let result = a + b + c
// console.log(result)

// 3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.
// let a = 100
// let b = 2
// console.log(a * b)

// 4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.
// let a = 67;
// console.log(a % 7);


// 5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность,
// произведение и частное (результат деления).
// let a =10
// let b = 2
// console.log(a + b)
// console.log(a - b)
// console.log(a * b)
// console.log(a / b)



// 6. Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте
// переменной result. Выведите в консоль значение переменной result.
// let c = 15
// let d = 12
// let result = c + d
// console.log(result)

// 7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат
// присвойте переменной c. Затем выведите в консоль остаток деления на 4 переменной c.
// let a = 30
// let b = 15
// let c = a + b
// console.log(c % 4)

// 8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат
// присвойте переменной c. Затем создайте переменную d, присвойте ей значение.
// Сложите переменные c и d, а результат запишите в переменную result. Выведите
// в консоль значение переменной result.
// let a = 17
// let b = 10
// let c = a - b
// let d = 11
// let result = c + d
// console.log(result)



// 9. Вам даны a='10' и b='99'. Сложите переменные a и b и присвойте результат
// переменной result и выведите её в консоль.
// let a = '10'
// let b = '99'
// let result = a + b
// console.log(result)
//
// let a = 10
// let b = 99
// let result = a + b
// console.log(result)

// 10. Вам даны переменные name='Аскар', number=10. Сложите данные переменные,
// присвойте результат переменной result и выведите её в консоль.

// let name='Аскар'
// let number=10
// let result = name + number
// console.log(result)








// == (равно)
// === (строго равно)
// != (не равно)
// !== (строго не равно)
// > (больше)
// < (меньше)
// >= (больше или равно)
// <= (меньше или равно)
// && (логическое И)
// || (логическое ИЛИ)
// ! (логическое НЕ)
//     ? : (тернарный оператор)
// typeof (возвращает тип операнда)
// + (сложение)
// - (вычитание)
// * (умножение)
// / (деление)
// % (остаток от деления)
// ++ (инкремент)
// -- (декремент)
//     = (присваивание значения)
// += (сложение с присваиванием)
// -= (вычитание с присваиванием)
// *= (умножение с присваиванием)
// /= (деление с присваиванием)
// %= (остаток от деления с присваиванием)



