// function  message (text, name) {
//     console.log(`${text}  ${name}`)
// }
//
// setTimeout(message, 1000, "Hello", "setTimeout")
// setInterval(message, 1000, "Hello", "setInterval")
//
//
//
// // Задание 1: Создайте функцию, которая принимает два аргумента и возвращает их сумму. Затем перепишите эту функцию как стрелочную функцию.
// //
//
// function text (one, two) {
//     console.log( one + two)
// }
//
// text(14,65)
//
//
//
// //     Задание 2: Напишите функцию, которая принимает массив чисел и возвращает сумму всех чисел в массиве. Затем перепишите эту функцию как стрелочную функцию.
// //
// function text (b) {
//     console.log(b**2)
// }
// text(5)
//
//
//
// //     Задание 3: Создайте функцию, которая принимает строку и возвращает количество символов в этой строке. Перепишите ее как стрелочную функцию.
// //
// //     Задание 4: Напишите функцию, которая принимает массив строк и возвращает новый массив, содержащий длины каждой строки. Затем перепишите эту функцию как стрелочную функцию.
// //
//
// function  dd (text) {
//     console.log(text.length)
// }
//
// dd('alisher')

//     Задание 5: Создайте функцию, которая принимает число и возвращает true, если число четное, и false, если нечетное. Перепишите ее как стрелочную функцию.




// Создайте функцию, которая принимает два аргумента и возвращает их сумму.
//     Напишите функцию, которая принимает число и возвращает его квадрат.
//     Создайте функцию, которая принимает массив чисел и возвращает сумму всех элементов массива.
//     Напишите функцию, которая принимает строку и возвращает её длину.
//     Создайте функцию, которая принимает массив строк и возвращает новый массив, содержащий длины каждой строки.
//     Напишите функцию, которая принимает массив чисел и возвращает новый массив, содержащий только четные числа.
//     Создайте функцию, которая принимает массив строк и возвращает новый массив, содержащий только строки, начинающиеся с определенной буквы.
//     Напишите функцию, которая принимает массив чисел и возвращает их произведение.
//     Создайте функцию, которая принимает массив объектов и возвращает новый массив, содержащий только объекты с определенным свойством.
//     Напишите функцию, которая принимает массив чисел и возвращает новый массив, содержащий только уникальные числа.
//     Создайте функцию, которая принимает строку и возвращает её в обратном порядке.
//     Напишите функцию, которая принимает массив строк и возвращает новый массив, содержащий только строки, содержащие определенное слово.
//     Создайте функцию-калькулятор, которая принимает два числа и оператор (+, -, *, /) и выполняет соответствующую операцию.
// Напишите функцию, которая принимает число и возвращает true, если оно простое, и false в противном случае.
//     Создайте стрелочную функцию, которая принимает массив чисел и возвращает их среднее значение.