// 1. Выведите столбец чисел от 1 до 50.

// for (let i = 1; i <= 50; i++){
//     console.log(i)
// }
// let a = []
// for (let i = 1; i <= 10 ; i++){
// a.push(i)
// }
// console.log(a)
// 2. Создайте переменную с пустым массивом, заполните массив 10-ю элементами X с помощью цикла.


// 3. Вам дан массив с элементами [5, 3, 1, 2, 7].
// С помощью цикла for выведите все эти элементы в консоль.
// let a = [5, 3, 1, 2, 7]
// for (let i =0; i < a.length; i++){
//     console.log(a[i])
// }
// 4. Вам дан массив с элементами [5, 2, 1, 2].
// С помощью цикла for найдите произведение элементов этого массива.
// let a = [5, 2, 1, 2]
// let result = 0
// for (let i =0; i < a.length; i++ ){
//    result += a[i]
// }


// 5. Выведите в консоль столбец четных чисел в промежутке от 0 до 100.
// for (let i = 100; i <= 100; i++ ){
//     if ( i % 2 === 0){
//         console.log(i)
//     }
// }

// 6. С помощью цикла найдите сумму чисел от 1 до 100 и выведите в консоль.


// 7. Вам дан массив с элементами [2, 4, 5, 6, 8].
// С помощью цикла for найдите сумму элементов этого массива.
// Запишите ее в переменную result.
// let str = [2, 4, 5, 6, 8]
// let result  = 0;
// for (let i =0; i <= a.length; i++){
//     result += a[i]
// }
// console.log(result)

// 8. Вам дан массив [3, 4, 6, 12, 3, 5].
// С помощью цикла for и оператора if
// выведите на экран столбец тех элементов массива,
// которые больше 3-х, но меньше 10.


// 9. Вам дан массив с числами.
// Числа могут быть положительными и отрицательными.
// Найдите сумму положительных элементов массива.


// 10. Вам дан массив с числами [5, 1, 3, 7, 6, 15, 3, 20].
// С помощью цикла for и оператора if проверьте есть ли в массиве элемент со значением,
// равным 4. Если есть - выведите на экран 'Есть!'
// и выйдите из цикла. Если нет - ничего делать не надо.
// let number = [5, 1, 3, 7, 6, 15, 3, 20];
// for (let i =0; i < number.length; i++){
//     if (number[i] === 4){
//         console.log('Есть!')
//     }
// }

// 11. Вам дан массив числами [10, 20, 30, 40, 135, 2000].
// Выведите на экран только те числа из массива,
// которые начинаются на цифру 1, 2 или 5.


// 12. Вам дан массив с элементами [1, 2, 3, 4, 5, 6, 7, 8, 9].
// С помощью цикла for создайте строку '-1-2-3-4-5-6-7-8-9-'.


// 13. Вам дано число n=1000.
// Делите его на 2 столько раз, пока результат деления не станет меньше 50.
// Какое число получится? Посчитайте количество итераций,
// необходимых для этого (итерация - это проход цикла),
// и запишите его в переменную num.


// 14. Вам дан массив с числами [1, 2, 3, 7, 6, 9].
//Найдите среднее арифметическое его элементов
// (сумма элементов, делить на количество).


// 15. Вам дан массив с числами [1, 2, 3, 4, 5].
// С помощью цикла найдите сумму квадратов элементов этого массива.


// 16. Вам дан массив с числами [1, 2, 4, -1, -3, 8, 7, 0, -5, 18, 12].
// С помощью цикла выведите только те элементы массива,
// которые больше нуля и меньше 10-ти.


// 17. Создайте переменную с пустым массивом,
// заполните массив 10-ю случайными числами
// от 1 до 10 с помощью цикла.


// 18. Создайте цикл, который суммирует числа,
// кратные 3 и 5 до 1000.


// 19. Вам дан массив
// [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21].
// Создайте цикл, который выводит нечетные числа, которые больше 10.


// 20. Вам дана строка 'jzvzszrzpz'.
// Измените каждую вторую букву на верхний регистр.


// 1. Напиши цикл for, который выводит числа от 1 до 5.
//
// for (let i = 1; i <= 5; i++){
//     console.log(i)
// }
// // 2. Используй цикл while, чтобы вывести четные числа от 2 до 10.
//     let i = 2;
// while (i <= 10)  {
//     if (i % 2 === 0){
//         console.log(i)
//     }
// i++;
// }
// 3. Напиши цикл do-while, который выводит квадраты чисел от 1 до 3.
// let i = 1;
// do {
//     console.log(i ** 2)
//     i++;
// }while (i <= 3)
//
// // 4. Используй цикл for, чтобы вывести значения в обратном порядке от 5 до 1.
//
// for (let i =5; i>=1; i--){
//     console.log(i)
// }

// 5. Напиши цикл while, который умножает числа от 1 до 3 на 2.
// let i = 1;
// while (i <= 3){
//     console.log(i * 2)
//     i++;
// }
// 6. Используй цикл do-while, чтобы вывести кубы чисел от 1 до 3.
// let i =1;
// do {
//     console.log(i ** 3)
//     i++;
// }while (i <= 3)
// // 7. Напиши цикл for, который суммирует числа от 1 до 5.
// let n = 0;
// for (let i = 1; i <= 5; i++){
//     n += i
// }
// console.log(n)
// // 8. Используй цикл while, чтобы вычесть 1 от каждого элемента в массиве чисел от 5 до 1.
// let numbers = [5,4,3,2,1];
// let test = []
// let i =0;
// while (i < numbers.length){
//     test.push( numbers[i]-1)
//     i++;
// }
// console.log(test)
// // 9. Напиши цикл do-while, который выводит квадратный корень чисел от 1 до 3.
// let i =1;
// do {
//     console.log(Math.sqrt(i))
//     i++;
// }while (i <= 3)
// 10. Используй цикл for, чтобы проверить, являются ли числа от 1 до 4 простыми.


// 11. Напиши цикл while, который удваивает числа от 2 до 8.

// 12. Используй цикл do-while, чтобы определить, являются ли числа от 1 до 3 квадратами целых чисел.
// 13. Напиши цикл for, который выводит только четные числа от 1 до 10.
// 14. Используй цикл while, чтобы создать новый массив, содержащий только нечетные числа от 1 до 7.
// 15. Напиши цикл do-while, который выводит квадраты чисел от 2 до 4.
// let name = 2;
// do{
//     console.log(name ** 2)
//     name++;
// }while (name <= 4)
// 16. Используй цикл for, чтобы проверить, являются ли числа от 3 до 6 квадратами других чисел.
// for (let i = 3; i <= 6; i++){
//     if ( i ** 2 === i){
//         console.log(i)
//     }
// }
// 17. Напиши цикл while, который выводит индексы элементов массива строк.
// let res = [12,3,56,723,34,912,7,23,]
// let i = 0;
// while (i <= res.length){
//     console.log(i)
//     i++;
// }
// 18. Используй цикл do-while, чтобы создать новый массив, содержащий индексы строк от 1 до 3.
// let i = 1;
// let arr = []
// do{
//     console.log(res.push(i))
//     i++;
// }while (i <= 3)
// console.log(arr)
// 19. Напиши цикл for, который проверяет, все ли элементы массива чисел от 1 до 5 больше нуля.
// let num = [1,2,3,4,5]
// for (let i = 0; i <= num.length; i++){
//     if (num[i] > 0){
//         console.log(num[i])
//     }
// }
// console.log(num)
// 20. Используй цикл while, чтобы проверить, есть ли в массиве строки длиной более 3 символов.
// let str = ['aghvs','vsdsbr','sgujsjvnsk','wer','ty','weifbtry']
// let i = 0;
// while (i < str.length){
//     if (str[i].length > 3 )
//         console.log(str[i])
//     i++;
// }
